lincomatic/ESP32_WiFi_V3.x/src/web_server.cpp
  config_save_advanced(qhostname);

  response->setCode(200);
  response->print("saved");
  request->send(response);
}

// -------------------------------------------------------------------
// Save Tesla
// url: /savetesla
// -------------------------------------------------------------------
void
handleSaveTesla(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  String user = request->getParam("user");
  String pass = request->getParam("pass");
  bool enable = isPositive(request->getParam("enable"));
  config_save_tesla(enable, user, pass);

  teslaClient.setUser(user.c_str());
  teslaClient.setPass(pass.c_str());

  if (enable) {
    teslaClient.requestAccessToken();
  }

  char tmpStr[200];
  snprintf(tmpStr, sizeof(tmpStr), "Saved: %s %s",
           teslaClient.getUser(),
           teslaClient.getPass());
  DBUGLN(tmpStr);

  response->setCode(200);
  response->print(tmpStr);
  request->send(response);
}

// -------------------------------------------------------------------
// Save Tesla Vehicle Idx
// url: /saveteslavi
// -------------------------------------------------------------------
void
handleSaveTeslaVI(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  String svi = request->getParam("vi");
  int vehidx = atoi(svi.c_str());
  teslaClient.setVehicleIdx(vehidx);
  config_save_tesla_vehidx(vehidx);

  char tmpStr[200];
  snprintf(tmpStr, sizeof(tmpStr), "Saved: %s",svi.c_str());
  DBUGLN(tmpStr);

  response->setCode(200);
  response->print(tmpStr);
  request->send(response);
}

// -------------------------------------------------------------------
// Get Tesla Vehicle Info
// url: /teslaveh
// -------------------------------------------------------------------
void
handleTeslaVeh(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  String s = "{";
  int vc = teslaClient.getVehicleCnt();
  s += "\"count:\"" + String(vc);
  if (vc) {
    s += ",[";
    for (int i=0;i < vc;i++) {
      s += "{\"id\":\"" + teslaClient.getVehicleId(i) + "\",";
      s += "\"name\":\"" + teslaClient.getVehicleDisplayName(i) + "\"}";
      if (i < vc-1) s += ",";
    }
    s += "]";
  }
  s += "}";

  response->setCode(200);
  response->print(s);
  request->send(response);
}



// -------------------------------------------------------------------
// Save the Ohm keyto EEPROM
// url: /handleSaveOhmkey
// -------------------------------------------------------------------
void
handleSaveOhmkey(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  bool enabled = isPositive(request->getParam("enable"));
  String qohm = request->getParam("ohm");

  config_save_ohm(enabled, qohm);

  response->setCode(200);
  response->print("saved");
  request->send(response);
}

// -------------------------------------------------------------------
// Returns status json
// url: /status
// -------------------------------------------------------------------
void
handleStatus(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  String s = "{";
  if (net_eth_connected()) {
    s += "\"mode\":\"Wired\",";
  } else if (net_wifi_mode_is_sta_only()) {
    s += "\"mode\":\"STA\",";
  } else if (net_wifi_mode_is_ap_only()) {
    s += "\"mode\":\"AP\",";
  } else if (net_wifi_mode_is_ap() && net_wifi_mode_is_sta()) {
    s += "\"mode\":\"STA+AP\",";
  }

  s += "\"wifi_client_connected\":" + String(net_wifi_client_connected()) + ",";
  s += "\"eth_connected\":" + String(net_eth_connected()) + ",";
  s += "\"net_connected\":" + String(net_is_connected()) + ",";
  s += "\"srssi\":" + String(WiFi.RSSI()) + ",";
  s += "\"ipaddress\":\"" + ipaddress + "\",";

  s += "\"emoncms_connected\":" + String(emoncms_connected) + ",";
  s += "\"packets_sent\":" + String(packets_sent) + ",";
  s += "\"packets_success\":" + String(packets_success) + ",";

  s += "\"mqtt_connected\":" + String(mqtt_connected()) + ",";

  s += "\"ohm_hour\":\"" + ohm_hour + "\",";

  s += "\"free_heap\":" + String(HAL.getFreeHeap()) + ",";

  s += "\"comm_sent\":" + String(rapiSender.getSent()) + ",";
  s += "\"comm_success\":" + String(rapiSender.getSuccess()) + ",";
  s += "\"rapi_connected\":" + String(rapiSender.isConnected()) + ",";

  s += "\"amp\":" + String(amp) + ",";
  s += "\"pilot\":" + String(pilot) + ",";
  s += "\"temp1\":" + String(temp1) + ",";
  s += "\"temp2\":" + String(temp2) + ",";
  s += "\"temp3\":" + String(temp3) + ",";
  s += "\"state\":" + String(state) + ",";
  s += "\"elapsed\":" + String(elapsed) + ",";
  s += "\"wattsec\":" + String(wattsec) + ",";
  s += "\"watthour\":" + String(watthour_total) + ",";

  s += "\"gfcicount\":" + String(gfci_count) + ",";
  s += "\"nogndcount\":" + String(nognd_count) + ",";
  s += "\"stuckcount\":" + String(stuck_count) + ",";

  s += "\"divertmode\":" + String(divertmode) + ",";
  s += "\"solar\":" + String(solar) + ",";
  s += "\"grid_ie\":" + String(grid_ie) + ",";
  s += "\"charge_rate\":" + String(charge_rate) + ",";
  s += "\"divert_update\":" + String((millis() - lastUpdate) / 1000) + ",";

  {
    const TESLA_CHARGE_INFO *tci = teslaClient.getChargeInfo();
    if (tci->isValid) {
      s += "\"batteryRange\":" + String(tci->batteryRange) + ",";
      s += "\"chargeEnergyAdded\":" + String(tci->chargeEnergyAdded) + ",";
      s += "\"chargeMilesAddedRated\":" + String(tci->chargeMilesAddedRated) + ",";
      s += "\"batteryLevel\":" + String(tci->batteryLevel) + ",";
      s += "\"chargeLimitSOC\":" + String(tci->chargeLimitSOC) + ",";
      s += "\"timeToFullCharge\":" + String(tci->timeToFullCharge) + ",";
      s += "\"chargerVoltage\":" + String(tci->chargerVoltage) + ",";
    }
  }

  s += "\"ota_update\":" + String(Update.isRunning());

#ifdef ENABLE_LEGACY_API
  s += ",\"networks\":[" + st + "]";
  s += ",\"rssi\":[" + rssi + "]";
  s += ",\"version\":\"" + currentfirmware + "\"";
  s += ",\"ssid\":\"" + esid + "\"";
  //s += ",\"pass\":\""+epass+"\""; security risk: DONT RETURN PASSWORDS
  s += ",\"emoncms_server\":\"" + emoncms_server + "\"";
  s += ",\"emoncms_node\":\"" + emoncms_node + "\"";
  //s += ",\"emoncms_apikey\":\""+emoncms_apikey+"\""; security risk: DONT RETURN APIKEY
  s += ",\"emoncms_fingerprint\":\"" + emoncms_fingerprint + "\"";
  s += ",\"mqtt_server\":\"" + mqtt_server + "\"";
  s += ",\"mqtt_topic\":\"" + mqtt_topic + "\"";
  s += ",\"mqtt_user\":\"" + mqtt_user + "\"";
  //s += ",\"mqtt_pass\":\""+mqtt_pass+"\""; security risk: DONT RETURN PASSWORDS
  s += ",\"www_username\":\"" + www_username + "\"";
  //s += ",\"www_password\":\""+www_password+"\""; security risk: DONT RETURN PASSWORDS
  s += ",\"ohmkey\":\"" + ohm + "\"";
#endif
  s += "}";

  response->setCode(200);
  response->print(s);
  request->send(response);
}

// -------------------------------------------------------------------
// Returns OpenEVSE Config json
// url: /config
// -------------------------------------------------------------------
void
handleConfig(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  String dummyPassword = String(DUMMY_PASSWORD);

